/*******************************************************************************
* 文 件 名: vector_init.cpp
* 文件描述: 快速初始化赋值
* 备    注: 
* 作    者: HanKin
* 创建日期: 2025.05.20
* 修改日期：2025.05.20
*
* Copyright (c) 2025 HanKin. All rights reserved.
*******************************************************************************/
#include <iostream>
#include <vector>

int main()
{
    std::vector<int> vec1(45, 0); // 创建一个包含 45 个值为 0 的元素的 vector

    std::vector<int> vec2;
    vec2.assign(45, 0); // 将 vector 的大小设置为 45，并将所有元素初始化为 0

    std::vector<int> vec3;
    vec3.resize(45, 0); // 调整 vector 大小为 45，并将所有元素初始化为 0

    std::vector<int> vec4 = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                             0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                             0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                             0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                             0, 0}; // 直接列出 45 个 0
    return 0;
}