# -*- coding: utf-8 -*-
"""
文 件 名: parse_virtual_keycode.py
文件描述: 解析虚拟键码
作    者: HanKin
创建日期: 2024.10.09
修改日期：2024.10.09

Copyright (c) 2024 HanKin. All rights reserved.
"""
import re

# 读取日志内容
with open("spy.sxl", "r", encoding="utf-16") as f:
    log_content = f.read()

#print(log_content)

# 提取虚拟键码
pattern = re.compile(r"chCharCode:'(\d+)'")
matches = pattern.findall(log_content)

# 转换虚拟键码（其实就是ASCII表）
key_map = {f'{code}': chr(code) for code in range(0x21, 0x7B)}
key_map.update({'13': 'Enter', '9': 'Tab'})
print(key_map)

# 打印转换结果
for match in matches:
    if match in key_map:
        print(f"虚拟键码 {match} 对应的字符是: {key_map[match]}")
    else:
        print(f"虚拟键码 {match} 没有对应的字符映射")

# 如果需要将虚拟键码转换为键盘或鼠标等效项，可以使用键盘或鼠标库
# 例如：pyautogui 或 keyboard 库
import pyautogui

# 示例：按下键 '6'
pyautogui.press('6')

'''
(base) D:\Users\User\Desktop>python k.py
{'33': '!', '34': '"', '35': '#', '36': '$', '37': '%', '38': '&', '39': "'", '40': '(', '41': ')', '42': '*', '43': '+', '44': ',', '45': '-', '46': '.', '47': '/', '48': '0', '49': '1', '50': '2', '51': '3', '52': '4', '53': '5', '54': '6', '55': '7', '56': '8', '57': '9', '58': ':', '59': ';', '60': '<', '61': '=', '62': '>', '63': '?', '64': '@', '65': 'A', '66': 'B', '67': 'C', '68': 'D', '69': 'E', '70': 'F', '71': 'G', '72': 'H', '73': 'I', '74': 'J', '75': 'K', '76': 'L', '77': 'M', '78': 'N', '79': 'O', '80': 'P', '81': 'Q', '82': 'R', '83': 'S', '84': 'T', '85': 'U', '86': 'V', '87': 'W', '88': 'X', '89': 'Y', '90': 'Z', '91': '[', '92': '\\', '93': ']', '94': '^', '95': '_', '96': '`', '97': 'a', '98': 'b', '99': 'c', '100': 'd', '101': 'e', '102': 'f', '103': 'g', '104': 'h', '105': 'i', '106': 'j', '107': 'k', '108': 'l', '109': 'm', '110': 'n', '111': 'o', '112': 'p', '113': 'q', '114': 'r', '115': 's', '116': 't', '117': 'u', '118': 'v', '119': 'w', '120': 'x', '121': 'y', '122': 'z', '13': 'Enter', '9': 'Tab'}
虚拟键码 90 对应的字符是: Z
虚拟键码 54 对应的字符是: 6
虚拟键码 54 对应的字符是: 6
虚拟键码 55 对应的字符是: 7
虚拟键码 52 对应的字符是: 4
虚拟键码 49 对应的字符是: 1
虚拟键码 80 对应的字符是: P
虚拟键码 69 对应的字符是: E
虚拟键码 48 对应的字符是: 0
虚拟键码 50 对应的字符是: 2
虚拟键码 48 对应的字符是: 0
虚拟键码 52 对应的字符是: 4
虚拟键码 66 对应的字符是: B
虚拟键码 53 对应的字符是: 5
虚拟键码 49 对应的字符是: 1
虚拟键码 48 对应的字符是: 0
虚拟键码 13 对应的字符是: Enter
虚拟键码 90 对应的字符是: Z
虚拟键码 54 对应的字符是: 6
虚拟键码 54 对应的字符是: 6
虚拟键码 55 对应的字符是: 7
虚拟键码 52 对应的字符是: 4
虚拟键码 49 对应的字符是: 1
虚拟键码 80 对应的字符是: P
虚拟键码 69 对应的字符是: E
虚拟键码 48 对应的字符是: 0
虚拟键码 50 对应的字符是: 2
虚拟键码 48 对应的字符是: 0
虚拟键码 54 对应的字符是: 6
虚拟键码 65 对应的字符是: A
虚拟键码 49 对应的字符是: 1
虚拟键码 49 对应的字符是: 1
虚拟键码 52 对应的字符是: 4
虚拟键码 13 对应的字符是: Enter
Traceback (most recent call last):
  File "k.py", line 27, in <module>
    import pyautogui
ModuleNotFoundError: No module named 'pyautogui'

(base) D:\Users\User\Desktop>
'''