/*******************************************************************************
* 文 件 名: 数组地址指针.cpp
* 文件描述: 
* 备    注: 
* 作    者: HanKin
* 创建日期: 2025.08.26
* 修改日期：2025.08.26
*
* Copyright (c) 2025 HanKin. All rights reserved.
*******************************************************************************/
#include <stdio.h>

int main() 
{ 
    int a[5] = {1, 2, 3, 4, 5}; 
    int *ptr1 = (int *)(&a + 1);    // 指向的是a整个数组在内存中的后一个位置（非法地址），也就是数组外的地址
    printf("%d, %d\n", *(a + 1), *(ptr1 - 1));  // 2, 5

    int *ptr2 = (int *)(a + 1);
    printf("%d, %d\n", *(a + 1), *(ptr2 - 1));  // 2, 1
    return 0; 
} 
